DesignPage.vue
<template>
    <div class="mybackground"></div>
    <div class="main">
        <div id="NM_BarGraph" class="NM_BarGraphChart"></div>
        <div class="title">
            <p class="my_title">国家博物馆</p>
            <p class="content">
                通过两幅热力图的比较，可以非常轻松的判断出哪幅是故宫博物院，哪幅是中国国家博物馆。
                但我们同时也创建了柱状图，点击进行交互，方便同年代不同文物种类进行快速的数量比较。
            </p>
        </div>
    </div>
</template>


<script>
export default {
    // 图表名称
    name: 'NM_BarGraph',
    methods: {
        myEcharts() {
            const NM_BarGraphChart = this.$echarts.init(
                document.getElementById('NM_BarGraph'),
                null,
                {
                    renderer: 'canvas',
                    useDirtyRect: false
                });
            const colorArray = [
                "#002fa7",
                "#12264f",
                "#206864",
                "#3d8386",
                "#32788a",
                "#5da39d",
                "#6ca8af",
                "#88bfb8",
                "#a4c9cc",
                "#a2d2e2"
            ];
            const option = {
                xAxis: {
                    data: ['旧石器', '新石器', '夏', '商', '周', '春秋', '战国', '秦', '汉', '三国', '魏晋南北朝', '隋', '唐', '五代十国', '宋/辽/金', '元', '明', '清', '近代', '现当代', '未知', '其它'],
                    axisLabel: {
                        interval: 0,  // 设置为0/表示全部显示
                    }
                },
                yAxis: {},
                dataGroupId: '',
                animationDurationUpdate: 500,
                series: {
                    type: 'bar',
                    id: 'sales',
                    data: [
                        {value: 18, groupId: '旧石器_1', itemStyle: {color: colorArray[0]}},
                        {value: 133, groupId: '新石器_1', itemStyle: {color: colorArray[1]}},
                        {value: 25, groupId: '夏_1', itemStyle: {color: colorArray[2]}},
                        {value: 125, groupId: '商_1', itemStyle: {color: colorArray[3]}},
                        {value: 83, groupId: '周_1', itemStyle: {color: colorArray[4]}},
                        {value: 53, groupId: '春秋_1', itemStyle: {color: colorArray[5]}},
                        {value: 177, groupId: '战国_1', itemStyle: {color: colorArray[6]}},
                        {value: 20, groupId: '秦_1', itemStyle: {color: colorArray[7]}},
                        {value: 240, groupId: '汉_1', itemStyle: {color: colorArray[8]}},
                        {value: 23, groupId: '三国_1', itemStyle: {color: colorArray[9]}},
                        {value: 112, groupId: '魏晋南北朝_1', itemStyle: {color: colorArray[8]}},
                        {value: 41, groupId: '隋_1', itemStyle: {color: colorArray[7]}},
                        {value: 187, groupId: '唐_1', itemStyle: {color: colorArray[6]}},
                        {value: 60, groupId: '五代十国_1', itemStyle: {color: colorArray[5]}},
                        {value: 282, groupId: '宋/辽/金_1', itemStyle: {color: colorArray[4]}},
                        {value: 69, groupId: '元_1', itemStyle: {color: colorArray[3]}},
                        {value: 285, groupId: '明_1', itemStyle: {color: colorArray[4]}},
                        {value: 902, groupId: '清_1', itemStyle: {color: colorArray[2]}},
                        {value: 315, groupId: '近代_1', itemStyle: {color: colorArray[1]}},
                        {value: 751, groupId: '现当代_1', itemStyle: {color: colorArray[0]}},
                        {value: 729, groupId: '未知_1', itemStyle: {color: colorArray[1]}},
                        {value: 16, groupId: '其它_1', itemStyle: {color: colorArray[2]}}
                    ],
                    universalTransition: {
                        enabled: true,
                        divideShape: 'clone'
                    },
                    itemStyle: {}
                }
            };
            const drilldownData = [
                {
                    dataGroupId: '旧石器_1',
                    data: [['丧葬用品', 0], ['书画', 0], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 0], ['印章', 5], ['宗教用品', 0], ['建筑构件', 0], ['文体娱乐', 0], ['文献', 0], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民 俗', 0], ['照片底片', 0], ['生产工具', 8], ['生活用品', 5], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 0], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '新石器_1',
                    data: [['丧葬用品', 11], ['书画', 0], ['交通工具', 0], ['兵器武器', 6], ['医疗卫生', 0], ['印章', 2], ['宗教用品', 1], ['建筑构件', 0], ['文体娱乐', 0], ['文献', 0], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 16], ['生活用品', 79], ['祭器礼器', 18], ['证件票据', 0], ['证章符号', 0], ['货币', 0], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '夏_1',
                    data: [['丧葬用品', 0], ['书画', 0], ['交通工具', 0], ['兵器武器', 1], ['医疗卫生', 0], ['印章', 0], ['宗教用品', 1], ['建筑构件', 0], ['文体娱乐', 0], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 1], ['照片底片', 0], ['生产工具', 1], ['生活用品', 7], ['祭器礼器', 2], ['证件票据', 0], ['证章符号', 0], ['货币', 11], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '商_1',
                    data: [['丧葬用品', 2], ['书画', 0], ['交通工具', 3], ['兵器武器', 4], ['医疗卫生', 0], ['印章', 13], ['宗教用品', 0], ['建筑构件', 0], ['文体娱乐', 0], ['文献', 4], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 2], ['照片底片', 0], ['生产工具', 6], ['生活用品', 68], ['祭器礼器', 22], ['证件票据', 0], ['证章符号', 0], ['货币', 1], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '周_1',
                    data: [['丧葬用品', 0], ['书画', 0], ['交通工具', 0], ['兵器武器', 2], ['医疗卫生', 0], ['印章', 9], ['宗教用品', 0], ['建筑构件', 1], ['文体娱乐', 0], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 2], ['生活用品', 55], ['祭器礼器', 12], ['证件票据', 0], ['证章符号', 0], ['货币', 1], ['邮 品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '春秋_1',
                    data: [['丧葬用品', 0], ['书画', 0], ['交通工具', 0], ['兵器武器', 6], ['医疗卫生', 0], ['印章', 4], ['宗教用品', 0], ['建筑构件', 0], ['文体娱乐', 3], ['文献', 0], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 2], ['生活用品', 29], ['祭器礼器', 5], ['证件票据', 0], ['证章符号', 0], ['货币', 4], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '战国_1',
                    data: [['丧葬用品', 0], ['书画', 0], ['交通工具', 3], ['兵器武器', 10], ['医疗卫生', 0], ['印章', 9], ['宗教用品', 0], ['建筑构件', 3], ['文体娱乐', 4], ['文献', 0], ['旗帜牌匾', 0], ['机械仪器', 3], ['模型', 0], ['民族民俗', 3], ['照片底片', 0], ['生产工具', 5], ['生活用品', 73], ['祭器礼器', 9], ['证件票据', 0], ['证章符号', 1], ['货币', 54], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '秦_1',
                    data: [['丧葬用品', 1], ['书画', 0], ['交通工具', 0], ['兵器武器', 3], ['医疗卫生', 0], ['印章', 1], ['宗教用品', 0], ['建筑构件', 6], ['文体娱乐', 0], ['文献', 4], ['旗帜牌匾', 0], ['机械仪器', 3], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 0], ['生活用品', 0], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 1], ['货币', 1], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '汉_1',
                    data: [['丧葬用品', 49], ['书画', 0], ['交通工具', 2], ['兵器武器', 7], ['医疗卫生', 3], ['印章', 7], ['宗教用品', 1], ['建筑构件', 3], ['文体娱乐', 3], ['文献', 2], ['旗帜牌匾', 0], ['机械仪器', 5], ['模型', 11], ['民族民俗', 31], ['照片底片', 0], ['生产工具', 5], ['生活用品', 90], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 1], ['货币', 20], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '三国_1',
                    data: [['丧葬用品', 3], ['书画', 0], ['交通工具', 0], ['兵器武器', 1], ['医疗卫生', 0], ['印章', 0], ['宗教用品', 0], ['建筑构件', 0], ['文体娱乐', 0], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 1], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 1], ['生活用品', 7], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 9], ['邮 品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '魏晋南北朝_1',
                    data: [['丧葬用品', 21], ['书画', 0], ['交通工具', 1], ['兵器武器', 1], ['医疗卫生', 0], ['印章', 2], ['宗教用品', 6], ['建筑构件', 6], ['文体娱乐', 1], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 1], ['模型', 1], ['民族民俗', 7], ['照片底片', 0], ['生产工具', 1], ['生活用品', 23], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 39], ['邮品', 0], ['雕塑造像', 1], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '隋_1',
                    data: [['丧葬用品', 13], ['书画', 0], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 0], ['印章', 0], ['宗教用品', 1], ['建筑构件', 2], ['文体娱乐', 0], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 0], ['生活用品', 22], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 1], ['邮 品', 0], ['雕塑造像', 1], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '唐_1',
                    data: [['丧葬用品', 41], ['书画', 2], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 3], ['印章', 0], ['宗教用品', 16], ['建筑构件', 16], ['文体娱乐', 2], ['文献', 9], ['旗帜牌匾', 0], ['机械仪器', 2], ['模型', 2], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 4], ['生活用品', 76], ['祭器礼器', 0], ['证件票据', 3], ['证章符号', 0], ['货币', 11], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '五代十国_1',
                    data: [['丧葬用品', 3], ['书画', 0], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 0], ['印 章', 0], ['宗教用品', 1], ['建筑构件', 1], ['文体娱乐', 1], ['文献', 1], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 0], ['生活用品', 12], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 41], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '宋/辽/金_1',
                    data: [['丧葬用品', 0], ['书画', 1], ['交通工具', 0], ['兵器武器', 1], ['医疗卫生', 3], ['印章', 2], ['宗教用品', 1], ['建筑构件', 9], ['文体娱乐', 0], ['文献', 15], ['旗帜牌匾', 0], ['机械仪器', 2], ['模型', 0], [' 民族民俗', 23], ['照片底片', 0], ['生产工具', 11], ['生活用品', 63], ['祭器礼器', 2], ['证件票据', 0], ['证章符号', 2], ['货币', 145], ['邮品', 0], ['雕塑造像', 2], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '元_1',
                    data: [['丧葬用品', 2], ['书画', 4], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 0], ['印章', 2], ['宗教用品', 0], ['建筑构件', 2], ['文体娱乐', 1], ['文献', 6], ['旗帜牌匾', 0], ['机械仪器', 6], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 1], ['生活用品', 25], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 20], ['邮 品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '明_1',
                    data: [['丧葬用品', 0], ['书画', 20], ['交通工具', 0], ['兵器武器', 3], ['医疗卫生', 1], ['印章', 0], ['宗教用品', 6], ['建筑构件', 2], ['文体娱乐', 0], ['文献', 44], ['旗帜牌匾', 0], ['机械仪器', 2], ['模型', 1], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 0], ['生活用品', 171], ['祭器礼器', 0], ['证件票据', 4], ['证章符号', 3], ['货币', 27], ['邮品', 0], ['雕塑造像', 1], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '清_1',
                    data: [['丧葬用品', 0], ['书画', 69], ['交通工具', 0], ['兵器武器', 5], ['医疗卫生', 0], ['印章', 4], ['宗教用品', 7], ['建筑构件', 0], ['文体娱乐', 1], ['文献', 131], ['旗帜牌匾', 2], ['机械仪器', 4], ['模型', 0], ['民族民俗', 20], ['照片底片', 299], ['生产工具', 2], ['生活用品', 239], ['祭器礼器', 0], ['证件票据', 2], ['证章符号', 0], ['货币', 113], ['邮品', 2], ['雕塑造像', 1], ['音像制品', 0], ['高科技', 1]]
                },
                {
                    dataGroupId: '近代_1',
                    data: [['丧葬用品', 0], ['书画', 48], ['交通工具', 0], ['兵器武器', 5], ['医疗卫生', 0], ['印章', 8], ['宗教用品', 0], ['建筑构件', 1], ['文体娱乐', 0], ['文献', 88], ['旗帜牌匾', 0], ['机械仪器', 2], ['模型', 0], ['民族民 俗', 0], ['照片底片', 110], ['生产工具', 0], ['生活用品', 8], ['祭器礼器', 0], ['证件票据', 2], ['证章符号', 4], ['货币', 0], ['邮品', 39], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '现当代_1',
                    data: [['丧葬用品', 0], ['书画', 108], ['交通工具', 2], ['兵器武器', 19], ['医疗卫生', 4], ['印章', 75], ['宗教用品', 1], ['建筑构件', 4], ['文体娱乐', 2], ['文献', 154], ['旗帜牌匾', 14], ['机械仪器', 11], ['模型', 11], ['民族民俗', 1], ['照片底片', 76], ['生产工具', 5], ['生活用品', 182], ['祭器礼器', 0], ['证件票据', 25], ['证章符号', 44], ['货币', 3], ['邮品', 5], ['雕塑造像', 1], ['音像制品', 1], ['高科技', 3]]
                },
                {
                    dataGroupId: '未知_1',
                    data: [['丧葬用品', 7], ['书画', 144], ['交通工具', 5], ['兵器武器', 19], ['医疗卫生', 0], ['印章', 85], ['宗教用品', 40], ['建筑构件', 2], ['文体娱乐', 2], ['文献', 117], ['旗帜牌匾', 12], ['机械仪器', 9], ['模型', 6], [' 民族民俗', 8], ['照片底片', 19], ['生产工具', 17], ['生活用品', 133], ['祭器礼器', 3], ['证件票据', 33], ['证章符号', 26], ['货币', 23], ['邮品', 16], ['雕塑造像', 3], ['音像制品', 0], ['高科技', 0]]
                },
                {
                    dataGroupId: '其它_1',
                    data: [['丧葬用品', 1], ['书画', 0], ['交通工具', 0], ['兵器武器', 0], ['医疗卫生', 0], ['印章', 0], ['宗教用品', 1], ['建筑构件', 1], ['文体娱乐', 0], ['文献', 0], ['旗帜牌匾', 0], ['机械仪器', 0], ['模型', 0], ['民族民俗', 0], ['照片底片', 0], ['生产工具', 2], ['生活用品', 10], ['祭器礼器', 0], ['证件票据', 0], ['证章符号', 0], ['货币', 1], ['邮品', 0], ['雕塑造像', 0], ['音像制品', 0], ['高科技', 0]]
                }
            ];
            NM_BarGraphChart.on('click', function (event) {
                if (event.data) {
                    const subData = drilldownData.find(function (data) {
                        return data.dataGroupId === event.data.groupId;
                    });
                    if (!subData) {
                        return;
                    }
                    NM_BarGraphChart.setOption({
                        xAxis: {
                            data: subData.data.map(function (item) {
                                    return item[0];
                                }
                            ),

                            axisLabel: {
                                fontSize: 10,
                                interval: 0,  // 设置为0/表示全部显示
                            }
                        },
                        series: {
                            type: 'bar',
                            id: 'sales',
                            dataGroupId: subData.dataGroupId,
                            data: subData.data.map(function (item) {
                                return item[1];
                            }),
                            universalTransition: {
                                enabled: true,
                                divideShape: 'clone'
                            },
                            itemStyle: {
                                color: event.data.itemStyle.color
                            }
                        },
                        graphic: [
                            {
                                type: 'text',
                                left: 50,
                                top: 20,
                                style: {
                                    text: 'Back',
                                    fontSize: 12
                                },
                                onclick: function () {
                                    NM_BarGraphChart.setOption(option);
                                }
                            }
                        ]
                    });
                }
            });
            NM_BarGraphChart.setOption(option);
        }
    },
    mounted() {
        this.myEcharts();
    }
}
</script>

<!--scoped保证样式只影响当前页面-->
<style scoped>
@import '../assets/css/font.css';


/*图表样式*/
.NM_BarGraphChart {
    /*图表宽度高度 用来设定图表展示出来的大小 一定要设置*/
    width: 1100px;
    height: 900px;
    background-size: cover;
    margin-left: 400px;
    margin-top: 0;
    margin-right: 0;
    /*margin-right: -10%;*/
    /*flex: 1;*/
    /*align-items: center;*/
}
.my_title{/*字体样式*/
    font-family: Fengyun, serif;
    /*字体大小*/
    font-size: 70px;
    color: rgba(2, 3, 9, 0.6);
    flex: 1;
    width: 500px;
    height: 100px;
    margin-top: 0;
    margin-left: -40px;
    z-index: 1;
}
/*标题样式*/
.title {
    /*字体样式*/
    font-family: Fengyun, serif;
    /*字体粗细*/
    font-weight: 40;
    /*字体大小*/
    font-size: 50px;
    color: rgba(2, 3, 9, 0.6);
    flex: 1;
    width: 100px;
    height: 100px;
    margin-top: 100px;
    margin-left: 100px;
    z-index: 1;
}


.main {
    z-index: 10;
    position: fixed;
    display: flex;
    flex-direction: row;
    width: 8200px;
    height: 100vh;
    left: 6400px;
    top: 0;
    /*align-items: center;*/
}

/*背景图设置*/
.mybackground {
    z-index: -1;
    position: relative;
    background-image: url("../assets/data/bg5.png");
    width: 100%;
    min-height: 100vh;
    background-size: 100% 100%;
}

.mybackground::before {
    content: "";
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background-color: #fffcf7; /* 设置半透明背景色 */
    opacity: 0.5; /* 设置透明度，取值范围为0到1，1为完全不透明 */
}
.content {
    /*字体样式*/
    font-family: Fengyun, serif;
    /*字体粗细*/
    font-weight: 10;
    /*字体大小*/
    font-size: 30px;
    color: rgba(2, 3, 9, 0.6);
    flex: 1;
    width: 500px;
    height: 100px;
    margin-top: 0;
    margin-left: -100px;
    z-index: 1;
}
</style>